src/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/БанковскиеСчета/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет организацию и валюту выбранного банковского счета.
//
// Параметры:
//  БанковскийСчет - СправочникСсылка.БанковскиеСчетаОрганизаций - Ссылка на банковский счет
//
// Возвращаемое значение:
//	Структура - Организация и валюта банковского счета
//
Функция ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	БанковскиеСчета.Владелец КАК Организация,
	                      |	БанковскиеСчета.ВалютаДенежныхСредств КАК Валюта,
	                      |	БанковскиеСчета.НомерСчета КАК НомерСчета,
	                      |	БанковскиеСчета.Банк КАК Банк,
	                      |	БанковскиеСчета.Банк.Код КАК БИК,
	                      |	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет
	                      |ИЗ
	                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |ГДЕ
	                      |	БанковскиеСчета.Ссылка = &БанковскийСчет");
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		Валюта = Выборка.Валюта;
		НомерСчета = Выборка.НомерСчета;
		Банк = Выборка.Банк;
		БИК = Выборка.БИК;
		КоррСчет = Выборка.КоррСчет;
	Иначе
		Организация = Неопределено;
		Валюта = Неопределено;
		НомерСчета = "";
		Банк = Неопределено;
		БИК = "";
		КоррСчет = "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Организация, Валюта, НомерСчета, Банк, БИК, КоррСчет",
		Организация,
		Валюта,
		НомерСчета,
		Банк,
		БИК,
		КоррСчет
	);
	
	Возврат СтруктураРеквизитов;

КонецФункции // ПолучитьРеквизитыБанковскогоСчетаОрганизации()

// Функция определяет банковский счет выбранной организации.
//
// Возвращает банковский счет организации, если найден один банковский счет.
// Возвращает Неопределено, если банковский счет не найден или счетов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Ссылка на организацию
//	Валюта - СправочникСсылка.Валюты - Валюта банковского счета
//
// Возвращаемое значение:
//	СправочникСсылка.БанковскиеСчетаОрганизаций - Найденный банковский счет организации
//
Функция ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация, Валюта = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	                      |	БанковскиеСчета.Ссылка КАК БанковскийСчет
	                      |ИЗ
	                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |ГДЕ
	                      |	НЕ БанковскиеСчета.ПометкаУдаления
	                      |	И (БанковскиеСчета.Владелец = &Организация
	                      |			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	                      |	И (БанковскиеСчета.ВалютаДенежныхСредств = &Валюта
	                      |			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)");
	
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		БанковскийСчет = Выборка.БанковскийСчет;
	Иначе
		БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
	Возврат БанковскийСчет;

КонецФункции // ПолучитьБанковскийСчетОрганизацииПоУмолчанию()

#КонецОбласти
